Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: The adoption of Quarkus has created a productive feedback loop between the two communities. Engineers from both projects have worked closely together to ensure Quarkus is used effectively within Polaris, reporting bugs and identifying possible enhancements along the way. This hands-on collaboration benefits both sides: Polaris gets a solid, well-understood foundation, while Quarkus gains real-world feedback from a demanding, high-throughput Apache TLP deployment, driving stability and performance improvements that benefit the entire Quarkus ecosystem.
ja_jp: Quarkusの採用は、両コミュニティー間で生産的なフィードバックループを生み出しました。両プロジェクトのエンジニアは緊密に協力し、QuarkusがPolaris内で効果的に使用されることを保証し、バグを報告し、途中で可能な改善点を特定しました。この実践的なコラボレーションは、両者に利益をもたらします。Polarisは堅牢で十分に理解された基盤を獲得し、Quarkusは要求の厳しい高スループットのApache TLPデプロイメントから実世界のフィードバックを得て、Quarkusエコシステム全体に利益をもたらす安定性とパフォーマンスの向上を推進します。

source: The advantage of pushing a whole container is that we are in complete control over its content and maybe even choose to deploy a container with a native executable running on GraalVM.
ja_jp: コンテナー全体をプッシュすることの利点は、その内容を完全にコントロールできることであり、GraalVM 上で動作するネイティブ実行可能ファイルを持つコンテナーをデプロイすることも可能です。

source: The aforementioned parameter needs to be annotated with `@NotBody` because it is only used to aid the construction of HTTP headers.
ja_jp: 前述のパラメーターは、HTTP ヘッダーの構築を支援するためにのみ使用されるため、 `@NotBody` アノテーションを付ける必要があります。

source: The aggregated and reranked content is passed to a <strong>Content Injector (Prompt Builder)</strong>. This component constructs an Enhanced Prompt for the Large Language Model (LLM) by incorporating the retrieved context alongside the original user query.
ja_jp: 集約され、再ランク付けされたコンテンツは、<strong>コンテンツ注入器 (プロンプトビルダー)</strong>に渡されます。このコンポーネントは、検索されたコンテキストを元のユーザーのクエリと一緒に組み込むことで、大規模言語モデル (LLM) のために強化されたプロンプトを構築します。

source: The aggregation temporality of the histogram.
ja_jp: ヒストグラムの集計一時性。

source: The algorithm starts with 100 allowed concurrent requests. For each request, it compares the number of current requests with the allowed limit and if the limit is exceeded, an overload situation is signalled.
ja_jp: アルゴリズムは、最初に 100 件の同時リクエストを許可します。 各リクエストについて、現在のリクエスト数を許可された制限と比較し、制限を超えた場合は過負荷状態が通知されます。

source: The all-open Kotlin plugin tells the compiler not to mark as final, those classes with the annotations highlighted (customize as required)
ja_jp: all-open Kotlinプラグインは、アノテーションがハイライトされているクラスを最終的なものとしてマークしないようにコンパイラに指示します (必要に応じてカスタマイズしてください)

source: The all-open configuration required, as per Maven guide above
ja_jp: 上記のMavenガイドにあるように、all-open設定が必要です。

source: The already started compose project may have been started by another Quarkus application running locally with the same project name, or manually using the `docker compose up` or `podman compose up` commands.
ja_jp: 既に起動している Compose プロジェクトは、同じプロジェクト名でローカルで実行されている別の Quarkus アプリケーションによって起動されたか、または `docker compose up` もしくは `podman compose up` コマンドを使用して手動で起動された可能性があります。

source: The alternative approach is to allow discovering the OIDC metadata (which is a default option) but require that only the remote JWT introspection is performed:
ja_jp: 別のアプローチは、OIDCメタデータのディスカバリーは許可するが（これはデフォルトのオプション）、リモートJWTイントロスペクションのみが実行されることを要求することです：

source: The alternative approach is to allow the default option of OIDC metadata discovery but also require that only the remote JWT introspection is performed, as shown in the following example:
ja_jp: 別の方法としては、デフォルトオプションである OIDC メタデータ検出を許可しながら、リモート JWT イントロスペクションのみを実行するよう要求する方法があります。次の例を参照してください。

source: The amount of milliseconds waiting for a graceful shutdown of the Kafka producer Type: _int_
ja_jp: Kafkaプロデューサーのグレースフルシャットダウンを待つミリ秒の量 Type: _int_

source: The amount of time for which a Vert.x worker thread can be blocked is also https://quarkus.io/guides/all-config#quarkus-vertx_quarkus-vertx-max-worker-execute-time[configurable].
ja_jp: Vert.x ワーカースレッドをブロックできる時間も link:https://quarkus.io/guides/all-config#quarkus-vertx_quarkus-vertx-max-worker-execute-time[設定可能] です。

source: The annotation `@ConfigProperties` is considered if and only if the active profile is not `test`.
ja_jp: アノテーション `@ConfigProperties` は、アクティブなプロファイルが `test` でない場合にのみ考慮されます。

source: The annotation `service.beta.openshift.io/serving-cert-secret-name` instructs OpenShift to generate a certificate and store it in a secret named `my-tls-secret`.
ja_jp: アノテーション `service.beta.openshift.io/serving-cert-secret-name` は、証明書を生成し、それを `my-tls-secret` という名前のシークレットに保存するよう OpenShift に指示します。

source: The annotation can also target a specific persistence unit (`@SearchExtension(persistenceUnit = "nameOfYourPU")`), backend (`@SearchExtension(backend = "nameOfYourBackend")`), index (`@SearchExtension(index = "nameOfYourIndex")`), or a combination of those (`@SearchExtension(persistenceUnit = "nameOfYourPU", backend = "nameOfYourBackend", index = "nameOfYourIndex")`).
ja_jp: アノテーションは、特定の永続ユニット (`@SearchExtension(persistenceUnit = "nameOfYourPU")`)、 バックエンド (`@SearchExtension(backend = "nameOfYourBackend")`)、 インデックス (`@SearchExtension(index = "nameOfYourIndex")`)もターゲットにすることができます。

source: The annotation can also target a specific persistence unit (`@SearchExtension(persistenceUnit = "nameOfYourPU")`).
ja_jp: アノテーションは、特定の永続ユニット (`@SearchExtension(persistenceUnit = "nameOfYourPU")`) をターゲットにすることもできます。

source: The annotation can optionally target a specific backend (`@SearchExtension(backend = "nameOfYourBackend")`), index (`@SearchExtension(index = "nameOfYourIndex")`), or a combination of those (`@SearchExtension(backend = "nameOfYourBackend", index = "nameOfYourIndex")`), when it makes sense for the type of the component being injected.
ja_jp: アノテーションは、注入されるコンポーネントのタイプに適している場合に、 オプションで特定の バックエンド (`@SearchExtension(backend = "nameOfYourBackend")`)、インデックス (`@SearchExtension(index = "nameOfYourIndex")`)、 またはそれらの組み合わせ (`@SearchExtension(backend = "nameOfYourBackend", index = "nameOfYourIndex")`) をターゲットにできます。

source: The annotation can optionally target a specific persistence unit (`@SearchExtension(persistenceUnit = "nameOfYourPU")`), backend (`@SearchExtension(backend = "nameOfYourBackend")`), index (`@SearchExtension(index = "nameOfYourIndex")`), or a combination of those (`@SearchExtension(persistenceUnit = "nameOfYourPU", backend = "nameOfYourBackend", index = "nameOfYourIndex")`), when it makes sense for the type of the component being injected.
ja_jp: アノテーションは、注入されるコンポーネントのタイプに適切な場合、オプションで特定の永続ユニット (`@SearchExtension(persistenceUnit = "nameOfYourPU")`)、 バックエンド(`@SearchExtension(backend = "nameOfYourBackend")`)、インデックス (`@SearchExtension(index = "nameOfYourIndex")`)、またはその組み合わせ (`@SearchExtension(persistenceUnit = "nameOfYourPU", backend = "nameOfYourBackend", index = "nameOfYourIndex")`) をターゲットにすることができます。

source: The annotation can optionally target a specific persistence unit with `@PersistenceUnitExtension(name = "nameOfYourPU")`.
ja_jp: このアノテーションは、オプションで `@PersistenceUnitExtension(name = "nameOfYourPU")` を使用して特定の永続化ユニットをターゲットにできます。

source: The annotation is repeatable so a single method could be scheduled multiple times.
ja_jp: アノテーションは繰り返し可能なので、1つのメソッドを複数回スケジュールすることができます。

source: The annotation value is a locale tag string (IETF).
ja_jp: アノテーションの値はロケールタグ文字列(IETF)です。

source: The annotation value is defined and preferred to the value defined in the localized file.
ja_jp: アノテーションの値は、ローカライズされたファイルに定義された値を優先して定義される。

source: The annotation value is not defined. In such a case, the value from supplementary localized file is taken.
ja_jp: アノテーションの値が定義されていない。この場合、ローカライズされた補足ファイルの値が使用される。

source: The annotation value is only used if no message template is defined in a localized file.
ja_jp: アノテーション値は、ローカライズされたファイルにメッセージテンプレートが定義されていない場合にのみ使用されます。

source: The annotations utilized by the Quarkus WebSockets next extension differ from those in JSR 356 despite, sometimes, sharing the same name. The JSR annotations carry a semantic that the Quarkus WebSockets Next extension does not follow.
ja_jp: Quarkus WebSockets Next エクステンションで使用されるアノテーションは、同じ名前を共有する場合もありますが、JSR 356 のアノテーションとは異なります。 JSR アノテーションには、Quarkus WebSockets Next エクステンションが従わないセマンティクスが含まれています。

source: The answer is that at application build time, right after the application archive is built, Quarkus launches the application, but only the parts of the launch process that are safe are run. More specifically, the application is run up until the steps that actually open sockets or run application logic.
ja_jp: その答えは、アプリケーションのビルド時に、アプリケーションアーカイブがビルドされた直後に、Quarkusによってアプリケーションが起動されますが、起動プロセスのうち安全な部分のみが実行されます。具体的には、実際にソケットを開いたり、アプリケーションロジックを実行したりするステップまで、アプリケーションが実行されます。

source: The answer lies with the specifics of the `org.eclipse.microprofile.jwt.JsonWebToken#getName()` implementation, which, according to the https://github.com/eclipse/microprofile-jwt-auth[MicroProfile MP JWT RBAC specification], checks an MP JWT specific `upn` claim, trying `preferred_username` next and finally `sub` which explains why you get the `Hello, auth0|60e5a305e8da5a006aef5471` answer even with the ID token containing the `name` claim. We can fix it easily by changing the endpoint `hello()` method's implementation to return a specific claim value:
ja_jp: 答えは、 `org.eclipse.microprofile.jwt.JsonWebToken#getName()` 実装の詳細にあります。 https://github.com/eclipse/microprofile-jwt-auth[MicroProfile MP JWT RBAC の仕様] によると、この実装は MP JWT 固有の `upn` クレームをチェックし、次に `preferred_username` を試行し、最後に `sub` を試行します。これが、ID トークンに `name` クレームが含まれていても、レスポンスとして `Hello, auth0|60e5a305e8da5a006aef5471` が返される理由です。これは、エンドポイント `hello()` メソッドの実装を、特定のクレーム値を返すように変更することで、簡単に修正できます。

source: The application
ja_jp: アプリケーション

source: The application built in this guide is just a JAX-RS endpoint (hello world) that relies on dependency injection to use a service. The service will be tested with JUnit 5 and the endpoint will be annotated via a `@QuarkusTest` annotation.
ja_jp: このガイドで構築されたアプリケーションは、サービスを使用するために依存性インジェクションに依存した JAX-RS エンドポイント (hello world) に過ぎません。サービスは JUnit 5 でテストされ、エンドポイントには `@QuarkusTest` のアノテーションが付けられます。

source: The application built in this guide is just a Jakarta REST endpoint (hello world) that relies on dependency injection to use a service. The service will be tested with JUnit 5 and the endpoint will be annotated via a `@QuarkusTest` annotation.
ja_jp: このガイドで作成するアプリケーションは、サービスを使用するために依存性の注入を使用した Jakarta REST エンドポイント (hello world) です。サービスは JUnit 5 でテストされ、エンドポイントには `@QuarkusTest` のアノテーションが付けられます。

source: The application built in this guide is just a Jakarta REST endpoint (hello world) that relies on dependency injection to use a service. The service will be tested with JUnit and the endpoint will be annotated via a `@QuarkusTest` annotation.
ja_jp: このガイドで作成するアプリケーションは、サービスを使用するために依存性の注入に依存した単なる Jakarta REST エンドポイント (hello world) です。サービスは JUnit でテストされ、エンドポイントには `@QuarkusTest` アノテーションが付けられます。

source: The application built in this guide is quite simple. The user fills a form on a web page. The web page sends the form content to the `BookResource` as JSON (using Ajax). The `BookResource` validates the user input and returns the _result_ as JSON.
ja_jp: このガイドで構築されたアプリケーションは非常にシンプルです。ユーザーはウェブページ上でフォームを入力します。Web ページはフォームの内容を JSON として `BookResource` に送信します (Ajax を使用)。 `BookResource` はユーザーの入力を検証し、 _結果_ をJSON として返します。

source: The application built in this guide is quite simple: the user can add elements in a list using a form and the list is updated.
ja_jp: このガイドで構築されるアプリケーションは非常にシンプルです: ユーザーはフォームを使用してリストに要素を追加することができ、リストは更新されます。

source: The application built in this guide simulates a simple backend for a gourmet coffee e-shop. It implements a REST endpoint providing information about coffee samples we have on store.
ja_jp: このガイドで構築されたアプリケーションは、グルメコーヒーのeショップのためのシンプルなバックエンドをシミュレートします。これは、店舗にあるコーヒーサンプルに関する情報を提供する REST エンドポイントを実装しています。

source: The application built in this quickstart guide is quite simple: the user can add elements in a list using a form, and the items list is updated. All the information between the browser and the server is formatted as JSON, and the elements are stored in the Cassandra database.
ja_jp: このガイドで構築されたアプリケーションは非常にシンプルです: ユーザーはフォームを使用してリストに要素を追加することができ、アイテムリストが更新されます。ブラウザーとサーバー間の情報はすべてJSONフォーマットで、各要素はCassandraデータベースに保存されます。

source: The application built into this guide is quite simple. It calls a weather service for two cities (Valence, France, and Athens, Greece) and decides the best place based on the current temperature.
ja_jp: このガイドに組み込まれているアプリケーションは非常にシンプルです。 2つの都市（フランスのヴァランスとギリシャのアテネ）の気象サービスを呼び出し、現在の気温に基づいて最適な場所を決定します。

source: The application can also run as a native executable. But, first, we need to instruct Quarkus to enable _ssl_ (if the remote API uses HTTPS). Open the `src/main/resources/application.properties` and add:
ja_jp: このアプリケーションは、ネイティブ実行可能ファイルとしても実行できます。しかし、その前に、Quarkusに _ssl_ を有効にするよう指示する必要があります（リモートAPIがHTTPSを使用している場合）。 `src/main/resources/application.properties` を開き、以下を追加します。

source: The application can be packaged using:
ja_jp: アプリケーションは以下でパッケージ化することができます:

source: The application can choose to handle the error case, but for the message consumption to continue, `Uni` returned from the `@Incoming` method must not result in failure. `PulsarTransactions#withTransactionAndAck` method will ack and nack the message but will not stop the reactive stream. Ignoring the failure simply resets the consumer to the last committed offsets and resumes the processing from there.
ja_jp: アプリケーションでエラーケースを処理することもできます。しかし、メッセージの消費を続行するには、 `@Incoming` メソッドから返される `Uni` が失敗しないようにする必要があります。 `PulsarTransactions#withTransactionAndAck` メソッドは、メッセージの確認応答と否定応答を行いますが、リアクティブストリームを停止しません。 失敗を無視すると、最後にコミットされたオフセットにコンシューマーがリセットされ、そこから処理が再開されます。

source: The application can programmatically start a transaction before accessing the methods of STM objects:
ja_jp: アプリケーションは、STM オブジェクトのメソッドにアクセスする前に、プログラム的にトランザクションを開始することができます。

source: The application can then be deployed to OpenShift Serverless by enabling the standard `quarkus.kubernetes.deploy=true` property.
ja_jp: その後、標準の `quarkus.kubernetes.deploy=true` プロパティを有効にすることで、アプリケーションを OpenShift Serverless にデプロイすることができます。

source: The application code in the Spring and Quarkus versions of the application should be as equivalent as possible to perform the same function. This means the domain models should be identical, and the underlying persistence mechanisms should be identical (in our case, JPA with Hibernate). Performance differences should come from architecture differences and library-integration optimisations in the frameworks themselves. If a change is made that changes the architecture of an application (i.e. moving blocking to reactive, using virtual threads, etc), then these changes should be applied to all the versions of the applications.
ja_jp: Spring版とQuarkus版のアプリケーションのコードは、同じ機能を実行するために可能な限り同等であるべきです。これは、ドメインモデルが同一であり、基盤となる永続化メカニズムが同一であるべきであることを意味します（私たちのケースでは、Hibernateを使用するJPA）。パフォーマンスの違いは、フレームワーク自体のアーキテクチャの違いとライブラリ統合の最適化から生じるべきです。アプリケーションのアーキテクチャを変更する変更（つまり、ブロッキングをリアクティブに移行する、仮想スレッドを使用するなど）が行われる場合、これらの変更はアプリケーションのすべてのバージョンに適用されるべきです。

source: The application created in this guide is straightforward: users can add elements to a list through a form, and the list gets updated accordingly.
ja_jp: このガイドで作成されるアプリケーションは簡単です。ユーザーがフォームを通じてリストに要素を追加でき、それに応じてリストが更新されます。

source: The application described in this guide allows to manage a (simple) library: you manage authors and their books.
ja_jp: このガイドに記載されているアプリケーションは、(シンプルな) 図書館を管理することができます:あなたは、著者とその本を管理します。

source: The application is now protected and the identities are provided by our LDAP server. Let's start the application in dev mode:
ja_jp: これで、アプリケーションは保護され、ID は LDAP サーバーから提供されるようになりました。 アプリケーションを開発モードで起動してみましょう。 :

source: The application is now protected and the identities are provided by our database.
ja_jp: アプリケーションは保護され、IDは私たちのデータベースから提供されるようになりました。

source: The application is now protected and the identities are provided by our database. The very first thing to check is to ensure the anonymous access works.
ja_jp: アプリケーションが保護され、アイデンティティがデータベースから提供されるようになりました。非常に最初に確認しなければならないことは、匿名アクセスが機能することを確認することです。

source: The application is now protected and the user identities are provided by the specified database.
ja_jp: これでアプリケーションは保護され、ユーザーIDは指定されたデータベースから提供されるようになりました。

source: The application is packaged using:
ja_jp: このアプリケーションは、以下の方法でパッケージ化されています。

source: The application is using bearer token authorization and the first thing to do is obtain an access token from the Keycloak Server in order to access the application resources:
ja_jp: アプリケーションはベアラートークン認可を使用しており、まず最初に行うべきことは、アプリケーションのリソースにアクセスするためにKeycloak サーバーからアクセストークンを取得することです。

source: The application must have been built with `quarkus.package.write-transformed-bytecode-to-build-output` set to `true`
ja_jp: アプリケーションは、 `quarkus.package.write-transformed-bytecode-to-build-output` が `true` に設定してビルドされていること

source: The application runs in dev mode, meaning that you can still update the code. It will reload it automatically.
ja_jp: アプリケーションは開発モードで動作します。つまり、コードをまだ変更することが出来、変更した場合、自動的にリロードされます。

source: The application shall manage fruit entities:
ja_jp: アプリケーションは、フルーツのエンティティを管理するものとします。

source: The application specifies two endpoints using `@Path("world")` and `@Path("/aliens")`
ja_jp: アプリケーションは、 `@Path("world")` と `@Path("/aliens")` のある2つのエンドポイントを指定します。

source: The application starts with AOT training enabled.
ja_jp: アプリケーションは AOT トレーニングが有効な状態で起動します。

source: The application uses bearer token authorization. To access its resources, first obtain an access token from the Keycloak server:
ja_jp: アプリケーションはベアラートークン認可を使用します。 リソースにアクセスするには、まず Keycloak サーバーからアクセストークンを取得します。

source: The application we will build makes use of both types of GraphQL clients. In both cases, they will connect to the Star Wars service at https://graphql.org/swapi-graphql[SWAPI] and query it for a list of Star Wars films, and, for each film, the names of the planets which appear in that film.
ja_jp: 今回作成するアプリケーションでは、どちらのタイプのGraphQLクライアントも使用します。どちらの場合も、 link:https://graphql.org/swapi-graphql[SWAPI]のスター・ウォーズサービスに接続し、スター・ウォーズの映画のリストと、各映画に登場する惑星の名前を問い合わせます。

source: The application will demonstrate how to send emails using the _imperative_ and _reactive_ mailer APIs.
ja_jp: このアプリケーションでは、 _命令型_ および _リアクティブ型_ のmailer APIを使用して電子メールを送信する方法をデモします。

source: The application will gather the following metrics:
ja_jp: このアプリケーションは、以下のメトリクスを収集します:

source: The application will have a generated URL and the terminal should output that. `heroku open hello` opens your default browser to access your new application using the '/hello' context. That page should output the text 'hello'.
ja_jp: アプリケーションには生成された URL があり、ターミナルにそれが出力されます。`heroku open hello` は、'/hello' コンテキストを使用して新しいアプリケーションにアクセスするためにデフォルトのブラウザーを開きます。そのページには 'hello' というテキストが出力されます。

source: The application will have a generated name and the terminal should output that. `heroku open` opens your default browser to access your new application.
ja_jp: アプリケーションには生成された名前があり、ターミナルにはその名前が出力されるはずです。 `heroku open` は、新しいアプリケーションにアクセスするためにデフォルトのブラウザで開きます。

source: The application will record the names of people it greets. Define an Entity by creating a `Greeting.java` class. Add the following content:
ja_jp: アプリケーションは、挨拶した人の名前を記録します。 `Greeting.java` クラスを作成して、 エンティティーを定義します。以下の内容を追加します。

source: The application will respond that 350 is not a prime number because it can be divided by 2.
ja_jp: アプリでは、350は2で割れるので素数ではないと回答します。

source: The application will respond that 629521085409773 is a prime number.
ja_jp: アプリケーションは、629521085409773が素数であると回答します。

source: The application, the init container and the job use the same `ServiceAccount` and therefore, share the same permissions.
ja_jp: アプリケーション、init コンテナ、ジョブは同じ `ServiceAccount` を使用するため、同じパーミッションを共有します。

source: The applications should be kept up-to-date with each Quarkus version and be part of the https://github.com/quarkusio/quarkus-ecosystem-ci[standard Quarkus ecosystem continuous integration^] and shown on the https://status.quarkus.io[Quarkus status dashboard^].
ja_jp: アプリケーションは、Quarkusの各バージョンで最新の状態に保たれ、 link:https://github.com/quarkusio/quarkus-ecosystem-ci[標準的なQuarkusエコシステムの継続的インテグレーション, window=_blank]の一部となり、 link:https://status.quarkus.io[Quarkusのステータスダッシュボード, window=_blank]に表示されることが望ましい

source: The approach to enable Quarkus conditional and extension build time (deployment) dependencies has changed in Quarkus 3.25.1 due to a few issues with the previous implementation. Specifically, the previous implementation would not apply relevant dependency exclusions to enabled conditional and deployment dependencies. It would also appear to leak devmode-only dependencies into non-devmode classpaths (such as test and prod) in some cases. These issues couldn't be fixed in a reasonable way in the previous implementation, which is why the Quarkus dependency resolution had to be re-implemented based on a different approach using link:https://docs.gradle.org/current/userguide/variant_aware_resolution.html[Gradle component variants].
ja_jp: Quarkus の条件付きおよびエクステンションのビルド時 (デプロイメント) の依存関係を有効にするアプローチは、以前の実装でのいくつかの問題により、Quarkus 3.25.1 で変更されました。具体的には、以前の実装では、有効な条件付きおよびデプロイメントの依存関係に、関連する依存関係の除外が適用されませんでした。また、いくつかのケースでは、開発モードのみの依存関係が非開発モードのクラスパス (テストや本番など) に漏洩しているように見えました。これらの問題は以前の実装では合理的な方法で修正できなかったため、Quarkus の依存関係解決は、link:https://docs.gradle.org/current/userguide/variant_aware_resolution.html[Gradle コンポーネントバリアント] を使用する異なるアプローチに基づいて再実装する必要がありました。

source: The appropriate in-container location varies depending on the database vendor. For PostgreSQL is "/var/lib/postgresql/data", but for MySQL, you would need this configuration instead:
ja_jp: コンテナ内の適切な場所は、データベース・ベンダーによって異なります。PostgreSQLの場合は"/var/lib/postgresql/data "ですが、MySQLの場合は代わりにこの設定が必要です：

source: The appropriate in-container location varies depending on the database vendor. For PostgresSQL is "/var/lib/postgresql/data", but for MySQL, you would need this configuration instead:
ja_jp: コンテナ内の適切な位置は、データベースベンダーによって異なります。PostgresSQLの場合は "/var/lib/postgresql/data" ですが、MySQLの場合は、代わりにこの設定が必要です:

source: The architecture is divided into two main phases:
ja_jp: アーキテクチャは主に2つのフェーズに分かれています:

source: The architecture of the Chain-of-Thought (CoT) blueprint focuses on guiding a Large Language Model (LLM) through explicit intermediate steps to solve complex problems, improve reasoning, and provide transparency in its decision-making.
ja_jp: Chain-of-Thought (CoT) ブループリントのアーキテクチャは、大規模言語モデル (LLM) を明示的な中間ステップを通じてガイドし、複雑な問題を解決し、推論を改善し、その意思決定に透明性を提供することに焦点を当てています。

source: The are times where you may have to add some additions to the `function.zip` lambda deployment that is generated by the build. To do this create a `zip.jvm` or `zip.native` directory within `src/main`. Create `zip.jvm/` if you are doing a pure Java lambda. `zip.native/` if you are doing a native deployment.
ja_jp: ビルドによって生成された `function.zip` Lambda デプロイメントにいくつかの追加を加えなければならない場合があります。これを行うには、 `src/main` 内に `zip.jvm` または `zip.native` ディレクトリーを作成します。Pure Java Lambda を実行している場合は `zip.jvm/` を、ネイティブディプロイメントを実行している場合は `zip.native/` を作成します。

source: The argument is the bindings source class.
ja_jp: 引数はバインディングソースクラスです。

source: The arrows from the previous code snippet indicate if the event comes from the upstream (source) or downstream (consumer).
ja_jp: 前のコードスニペットの矢印は、イベントが上流(ソース)から来るのか、下流(コンシューマ)から来るのかを示しています。
